## Plan for s3_scan_object
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 3 to add, 0 to change, 3 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.s3_scan_object_exire_untagged must be replaced
-/+ resource "aws_ecr_lifecycle_policy" "s3_scan_object_exire_untagged" {
      ~ id          = "scan-files/s3-scan-object" -> (known after apply)
      ~ registry_id = "806545929748" -> (known after apply)
      ~ repository  = "scan-files/s3-scan-object" -> "scan-files/module/s3-scan-object" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_ecr_repository.s3_scan_object must be replaced
-/+ resource "aws_ecr_repository" "s3_scan_object" {
      ~ arn                  = "arn:aws:ecr:ca-central-1:806545929748:repository/scan-files/s3-scan-object" -> (known after apply)
      ~ id                   = "scan-files/s3-scan-object" -> (known after apply)
      ~ name                 = "scan-files/s3-scan-object" -> "scan-files/module/s3-scan-object" # forces replacement
      ~ registry_id          = "806545929748" -> (known after apply)
      ~ repository_url       = "806545929748.dkr.ecr.ca-central-1.amazonaws.com/scan-files/s3-scan-object" -> (known after apply)
        tags                 = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (2 unchanged attributes hidden)

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

        # (1 unchanged block hidden)
    }

  # aws_ecr_repository_policy.s3_scan_object must be replaced
-/+ resource "aws_ecr_repository_policy" "s3_scan_object" {
      ~ id          = "scan-files/s3-scan-object" -> (known after apply)
      ~ policy      = (sensitive)
      ~ registry_id = "806545929748" -> (known after apply)
      ~ repository  = "scan-files/s3-scan-object" -> "scan-files/module/s3-scan-object" # forces replacement
    }

Plan: 3 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
